{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report detailing two image‑default update features and their associated files and components.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for several frontend React components, styles, and hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables and light/dark theme tokens for the frontend.",
  "frontend/index.html": "Root HTML document loading the React app via main.tsx and defining the page metadata.",
  "frontend/src/App.tsx": "Main homepage component with Yes/No logic, couple photo picker using IMG_20260208_030749.jpg, and modal trigger behavior.",
  "frontend/src/components/ValentineModal.tsx": "Modal component showing a celebration image with a replaceable default image and escape/backdrop close behavior.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useClientImagePreview.ts": "Hook providing client-side image previewing with validation, stale-read protection, load/error handling, and preview state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth, exposing identity state, login/clear actions, and status helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom Valentine-themed color variables with dark mode variants and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Stores project metadata, requirements, architecture notes, existing features, and known issues for the Valentine website."
}