{
  "backend/main.mo": "Empty actor definition for the backend canister.",
  "feature_evidence.json": "Metadata describing a feature update to modify the homepage headline text and associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including App, ValentineModal, global styles, Tailwind config, and the image-preview hook.",
  "frontend/index.css": "Tailwind base stylesheet defining extensive OKLCH color variables for light and dark modes plus global background and text rules.",
  "frontend/index.html": "Base HTML document setting up the root div and loading the React main entrypoint.",
  "frontend/src/App.tsx": "Main interactive homepage component with Yes/No logic, dynamic button scaling, couple photo preview and picker, and Valentine UI styling.",
  "frontend/src/components/ValentineModal.tsx": "Celebratory modal with image preview and picker, animated hearts, escape/backdrop dismissal, and close controls.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useClientImagePreview.ts": "Hook providing client‑side image selection, validation, preview generation, error handling, and reset support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login state, stored identity loading, and AuthClient lifecycle.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom OKLCH theme variables for light/dark Valentine styling, plus animation delay utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider, loading global styles and rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended OKLCH color theming, fonts, animations, and plugins.",
  "project_state.json": "Describes project state for a Valentine-themed interactive site, listing features, requirements, and architectural notes."
}