{
  "backend/main.mo": "Empty Motoko actor representing a placeholder backend canister.",
  "feature_evidence.json": "Feature evidence report defining a homepage image‑loading update tied to App.tsx with metadata and linked components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files including App.tsx, modal, CSS, Tailwind config, image preview hook, and asset URL utility.",
  "frontend/index.css": "Root-level Tailwind CSS theme variables and dark‑mode overrides for colors, borders, and backgrounds.",
  "frontend/index.html": "Minimal HTML shell mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main interactive Valentine page with Yes/No logic, escalating Yes button, customizable photo picker, and modal trigger.",
  "frontend/src/components/ValentineModal.tsx": "Popup modal showing a celebration image with its own image picker, escape/backdrop close logic, and decorative animations.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity and react-query.",
  "frontend/src/hooks/useClientImagePreview.ts": "Hook enabling client-side image selection with preview, validation, load tracking, fallback handling, and error management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login flow, and status flags.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark Valentine-themed colors and animation utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/assetUrl.ts": "Utility to build asset URLs using Vite’s BASE_URL, ensuring paths resolve correctly in production.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores project metadata, feature requirements, issues, and architectural notes for the Valentine website’s development state."
}