{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report listing two frontend feature updates and the files they modify.",
  "frontend-file-summaries.txt": "Text file containing short summaries for several frontend source files.",
  "frontend/index.css": "Base Tailwind layer defining color variables, dark mode overrides, and global border/background styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main homepage component with Yes/No logic, dynamic scaling buttons, single image picker with preview handling, and modal trigger.",
  "frontend/src/components/ValentineModal.tsx": "Modal component showing a celebration image with its own image picker, escape/backdrop close logic, and animated UI.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useClientImagePreview.ts": "Custom hook that manages client-side image selection, preview loading, error handling, and fallback logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status handling via AuthClient.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes, plus utility animations and delays.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/assetUrl.ts": "Utility to build safe, base-path-aware asset URLs using Vite’s BASE_URL.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color variables, typography, animations, and extended theme settings.",
  "project_state.json": "Metadata describing project state, requirements, issues, and architectural notes for a Valentine website build."
}