{
  "kind": "build_request",
  "title": "Add couple photo image to homepage",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Add a couple photo image to the homepage inside the main question card, visually integrated with the existing Valentine theme (rounded corners, subtle border/shadow), and positioned so it does not interfere with the Yes/No interaction (including the Yes button growth behavior).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I need to add an image of ours on the website homepage"
        ]
      },
      "acceptanceCriteria": [
        "The homepage displays a couple photo within the main card alongside the existing heart icon, question text, and buttons.",
        "The photo is responsive (looks good on mobile and desktop), maintains aspect ratio, and does not overflow the card.",
        "The photo does not block clicks on the Yes/No buttons at any escalation stage.",
        "An accessible alt attribute is provided for the couple photo image."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add the couple photo as a static asset under `frontend/public/assets/generated/` and reference it directly from the homepage UI (do not serve images from the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I need to add an image of ours on the website homepage"
        ]
      },
      "acceptanceCriteria": [
        "A new image file exists at `frontend/public/assets/generated/couple-photo.dim_1200x1200.jpg`.",
        "The homepage references the photo via a direct public path (e.g., `/assets/generated/couple-photo.dim_1200x1200.jpg`).",
        "No backend code is added or changed to support serving this image."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under `frontend/src/components/ui` or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep all existing homepage behaviors intact (No-click error message, Yes button escalation, No button fade/disable, modal on Yes).",
    "Do not route images through the backend; images must be served as static frontend assets from `frontend/public/assets/generated/`.",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Changing the existing popup modal image or message text.",
    "Adding image upload functionality or any user-driven image management UI.",
    "Adding or modifying authentication behavior."
  ],
  "imageRequirements": {
    "required": [
      "Couple photo portrait-style image, warm romantic tone, centered framing (couple-photo.dim_1200x1200.jpg)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}