{
  "kind": "build_request",
  "title": "Show only one image on homepage and move the other image into the Yes-success popup modal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Update the homepage (frontend/src/App.tsx) so it displays exactly one photo (the main couple photo area with the existing file picker/preview) and remove the secondary/static photo element currently rendered alongside it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I need only one picture on the first home page and the other on the popup page"
        ]
      },
      "acceptanceCriteria": [
        "On the homepage, only one photo is visible (the photo tied to the existing homepage file picker).",
        "The secondary photo currently rendered from getAssetUrl('assets/image-2.jpg') is no longer rendered anywhere on the homepage.",
        "Homepage layout remains visually balanced after removing the second image, and does not interfere with the Yes/No interaction or the Yes-button growth behavior."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Update the success popup modal (frontend/src/components/ValentineModal.tsx) so its default image uses the other static photo (the one removed from the homepage), and ensure that photo is only shown in the modal after the user clicks “Yes”. Keep the existing modal image picker/preview behavior intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "only one of the image is on the homepage and the other image will be on the popup page after she selects yes"
        ]
      },
      "acceptanceCriteria": [
        "When the modal opens (after clicking Yes), the modal shows the second static photo by default (instead of the current valentine-popup-illustration default).",
        "The second static photo is not shown anywhere on the homepage.",
        "The modal’s existing image picker still allows selecting a device image and previewing it in the modal, with existing validation and inline error handling preserved.",
        "All default static image URLs continue to be built via getAssetUrl(...) (no absolute root paths)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui) must not be edited.",
    "Keep backend as-is (single-actor Motoko canister); no backend changes required for this request.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not change the Yes/No escalation behavior beyond any minimal layout adjustments required by removing the extra homepage image.",
    "Do not introduce new authentication, storage, or backend image serving.",
    "Do not generate new images; reuse the existing static assets already referenced by the app."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}