{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add couple photo static asset to homepage question card",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Display a responsive couple photo inside the homepage main question card without interfering with Yes/No interactions.",
      "acceptanceCriteria": [
        "The homepage displays a couple photo within the main card alongside the existing heart icon, question text, and buttons.",
        "The photo is responsive (looks good on mobile and desktop), maintains aspect ratio, and does not overflow the card.",
        "The photo does not block clicks on the Yes/No buttons at any escalation stage.",
        "An accessible alt attribute is provided for the couple photo image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add an <img> to the question card (between the heading/error area and the buttons) referencing the static asset at frontend/public/assets/generated/couple-photo.dim_1200x1200.jpg; style it to match the Valentine theme (rounded corners, subtle border/shadow), keep it responsive (preserve aspect ratio, constrain max height/width so it never overflows), and ensure it cannot intercept pointer events so Yes/No remain clickable even when the Yes button scales."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add the couple photo as a static generated asset and reference it directly from the homepage UI.",
      "acceptanceCriteria": [
        "A new image file exists at `frontend/public/assets/generated/couple-photo.dim_1200x1200.jpg`.",
        "The homepage references the photo via a direct public path (e.g., `/assets/generated/couple-photo.dim_1200x1200.jpg`).",
        "No backend code is added or changed to support serving this image."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/couple-photo.dim_1200x1200.jpg",
          "operation": "create",
          "description": "Add the provided/generated couple portrait image asset (1200x1200) at this exact path so it can be served as a static public file."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Reference the couple photo via a direct public path (/assets/generated/couple-photo.dim_1200x1200.jpg) from the homepage UI; do not add any backend routing or fetching logic."
        }
      ]
    }
  ]
}