{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Single homepage image and move secondary image into Yes-success modal",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Remove the secondary/static homepage photo so the homepage shows only the main image picker/preview photo, keeping layout balanced and Yes/No behavior unaffected.",
      "acceptanceCriteria": [
        "On the homepage, only one photo is visible (the photo tied to the existing homepage file picker).",
        "The secondary photo currently rendered from getAssetUrl('assets/image-2.jpg') is no longer rendered anywhere on the homepage.",
        "Homepage layout remains visually balanced after removing the second image, and does not interfere with the Yes/No interaction or the Yes-button growth behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Delete the secondary/static photo block that renders getAssetUrl('assets/image-2.jpg') and adjust the surrounding container/layout classes so the single remaining image picker/preview area stays centered and visually balanced without affecting the existing Yes/No interaction or Yes-button growth behavior."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Change the success popup modal default image to use the static photo removed from the homepage, shown only after clicking Yes, while preserving the modal image picker/preview behavior and getAssetUrl usage.",
      "acceptanceCriteria": [
        "When the modal opens (after clicking Yes), the modal shows the second static photo by default (instead of the current valentine-popup-illustration default).",
        "The second static photo is not shown anywhere on the homepage.",
        "The modal’s existing image picker still allows selecting a device image and previewing it in the modal, with existing validation and inline error handling preserved.",
        "All default static image URLs continue to be built via getAssetUrl(...) (no absolute root paths)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ValentineModal.tsx",
          "operation": "modify",
          "description": "Update the useClientImagePreview defaultSrc to getAssetUrl('assets/image-2.jpg') so the modal shows that static photo by default when opened; keep the existing file input, preview/validation, and inline error rendering unchanged, and retain getAssetUrl(...) for building the static image URL."
        }
      ]
    }
  ]
}