{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Success modal image picker + homepage name capitalization",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Capitalize the name in the homepage question headline to \"Annammooo\" without changing any other text.",
      "acceptanceCriteria": [
        "The homepage headline renders exactly: \"Annammooo will you be my valentine\" (same wording as before, with only the name’s capitalization changed).",
        "No other user-facing text is changed as part of this requirement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the homepage <h1> question text to replace \"annammooo\" with \"Annammooo\" while keeping the rest of the sentence unchanged."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add a client-side image upload/picker to the success modal with preview and inline validation errors, mirroring homepage behavior without interfering with it.",
      "acceptanceCriteria": [
        "When the success modal is open, the image area in the modal provides a visible control to choose an image from the user’s device (via a file picker).",
        "After a valid image is selected, the modal displays the selected image as a preview (client-side only; no backend upload).",
        "If the user selects a non-image file, an English, user-friendly inline error message is shown within the modal.",
        "If the selected image file is too large or cannot be previewed, an English, user-friendly inline error message is shown within the modal.",
        "The modal continues to work as before: escape key closes it, clicking the backdrop closes it, and the close (X) button closes it.",
        "The new modal image picker does not break or interfere with the existing homepage image picker."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ValentineModal.tsx",
          "operation": "modify",
          "description": "Add an independent, modal-local image picker: use the existing useClientImagePreview hook for client-side validation + preview, add a visible \"Choose Photo\" control in the modal image area (with hidden file input and reset-to-reselect behavior), and render inline error messaging within the modal while preserving existing escape/backdrop/X close behaviors."
        }
      ]
    }
  ]
}